CSI API ETABS v1
cFrameObj.SetTCLimits Method
 Makes tension/compression force limit assignments to frame objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetTCLimits(
	string Name,
	bool LimitCompressionExists,
	double LimitCompression,
	bool LimitTensionExists,
	double LimitTension,
	eItemType ItemType = eItemType.Objects
)
Function SetTCLimits (
	Name As String,
	LimitCompressionExists As Boolean,
	LimitCompression As Double,
	LimitTensionExists As Boolean,
	LimitTension As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim LimitCompressionExists As Boolean
Dim LimitCompression As Double
Dim LimitTensionExists As Boolean
Dim LimitTension As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetTCLimits(Name,
	LimitCompressionExists, LimitCompression,
	LimitTensionExists, LimitTension,
	ItemType)
int SetTCLimits(
	String^ Name,
	bool LimitCompressionExists,
	double LimitCompression,
	bool LimitTensionExists,
	double LimitTension,
	eItemType ItemType = eItemType::Objects
)
abstract SetTCLimits :
        Name : string *
        LimitCompressionExists : bool *
        LimitCompression : float *
        LimitTensionExists : bool *
        LimitTension : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group depending on the value of the ItemType item.
LimitCompressionExists
Type: System.Boolean
 This item is True if a compression force limit exists for the frame object.
LimitCompression
Type: System.Double
 The compression force limit for the frame object. [F]
LimitTensionExists
Type: System.Boolean
 This item is True if a tension force limit exists for the frame object.
LimitTension
Type: System.Double
 The tension force limit for the frame object. [F]
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the assignments are successfully applied, otherwise it returns a nonzero value.
Remarks
 Note that the tension and compression limits are only used in nonlinear analyses.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'assign tension/compression limits
       ret = SapModel.FrameObj.SetTCLimits("1", False, 0, True, 100)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace